Тестовая_база_ERP_14/src/InformationRegisters/ПротоколыРасчетаПартийИСебестоимости/ПротоколыРасчетаПартийИСебестоимости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПротоколыРасчетаПартийИСебестоимости</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Протокол</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДлительностьРасчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОрганизаций</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРасчета</name>
    <type>
      <types>EnumRef.ВариантыРасчетаПартийИСебестоимости</types>
    </type>
  </attributes>
  <attributes>
    <name>БылиОшибки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОшибок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/InformationRegisters/ПротоколыРасчетаПартийИСебестоимости/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Возвращает текстовый документ, содержащий протокол расчета.
//
Функция ПолучитьТекстПротокола(Идентификатор, Период = Неопределено, ПериодРасчета = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Т.Период
		|ИЗ
		|	РегистрСведений.ПротоколыРасчетаПартийИСебестоимости КАК Т
		|ГДЕ
		|	Т.Идентификатор = &Идентификатор
		|	И &ПериодРасчета В (Т.ПериодРасчета, НЕОПРЕДЕЛЕНО)";
		
		Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
		Запрос.УстановитьПараметр("ПериодРасчета", ПериодРасчета);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() = 0 Тогда
			
			ВызватьИсключение НСтр("ru = 'Протокола расчета не найден. Возможно протокол был удален.';
									|en = 'Cannot find calculation protocol. The protocol might have been deleted.'");
			
		КонецЕсли;
		
		Выборка.Следующий();
		
		ПериодЗаписи = Выборка.Период;
		
	Иначе
		ПериодЗаписи = Период;
	КонецЕсли;
	
	// Прочитаем запись протокола
	ЗаписьПротокола = РегистрыСведений.ПротоколыРасчетаПартийИСебестоимости.СоздатьМенеджерЗаписи();
	ЗаписьПротокола.Период		  = ПериодЗаписи;
	ЗаписьПротокола.Идентификатор = Идентификатор;
	
	ЗаписьПротокола.Прочитать();
	
	Если ЗаписьПротокола.Выбран() Тогда
		
		// Получим протокол в формате текстового документа
		Протокол = ЗаписьПротокола.Протокол.Получить();
		
		Если ТипЗнч(Протокол) <> Тип("ТекстовыйДокумент") Тогда
			ВызватьИсключение НСтр("ru = 'Ошибка получения текста протокола расчета.';
									|en = 'An error occurred when receiving the calculation protocol text.'");
		КонецЕсли;
		
	Иначе
		
		ВызватьИсключение НСтр("ru = 'Протокола расчета не найден. Возможно протокол был удален.';
								|en = 'Cannot find calculation protocol. The protocol might have been deleted.'");
		
	КонецЕсли;
	
	Возврат Протокол;
	
КонецФункции

#КонецОбласти

#КонецЕсли
